{
  "machine_learning": {
    "name": "machine_learning",
    "display_name": "Machine Learning",
    "description": "A subset of artificial intelligence that enables computers to learn and make decisions from data without being explicitly programmed.",
    "detailed_description": "Machine Learning is a powerful branch of artificial intelligence that focuses on building systems that can learn from and make predictions or decisions based on data. Unlike traditional programming where rules are explicitly coded, machine learning algorithms identify patterns in data and use these patterns to make predictions on new, unseen data. This approach has revolutionized fields from image recognition to natural language processing, recommendation systems, and predictive analytics.",
    "category": "Artificial Intelligence",
    "subcategory": "Machine Learning",
    "domain": "Computer Science",
    "difficulty_level": "advanced",
    "complexity_score": 9.0,
    "cognitive_load": 9.2,
    "key_terms": [
      "algorithm",
      "training data",
      "model",
      "prediction",
      "feature",
      "label",
      "supervised learning",
      "unsupervised learning",
      "neural network",
      "gradient descent",
      "overfitting"
    ],
    "synonyms": [
      "ML",
      "Statistical Learning",
      "Pattern Recognition"
    ],
    "learning_objectives": [
      "Understand the difference between supervised, unsupervised, and reinforcement learning",
      "Learn to prepare and preprocess data for machine learning models",
      "Implement basic machine learning algorithms from scratch",
      "Evaluate model performance using appropriate metrics",
      "Apply machine learning to solve real-world problems"
    ],
    "practical_applications": [
      "Email spam detection and content filtering",
      "Recommendation systems for e-commerce and streaming platforms",
      "Image recognition and computer vision applications",
      "Natural language processing and chatbots",
      "Fraud detection in financial transactions"
    ],
    "real_world_examples": [
      "Netflix's recommendation engine that suggests movies based on viewing history",
      "Google Photos automatically organizing and tagging images",
      "Amazon's product recommendations and dynamic pricing",
      "Spotify's music discovery and playlist generation",
      "Tesla's autonomous driving and safety features"
    ],
    "common_misconceptions": [
      "Machine learning can solve any problem with enough data - domain expertise is still crucial",
      "More complex models are always better - simpler models can be more interpretable and effective",
      "Machine learning replaces human decision making - it's a tool to augment human capabilities",
      "Training data quality doesn't matter - garbage in, garbage out still applies",
      "All machine learning is the same - different types serve different purposes"
    ]
  },
  "data_structures": {
    "name": "data_structures",
    "display_name": "Data Structures",
    "description": "Specialized formats for organizing, storing, and managing data efficiently in computer systems.",
    "detailed_description": "Data structures are fundamental building blocks in computer science that define how data is organized, stored, and manipulated within a program. Different data structures are optimized for different operations - some excel at fast insertions, others at efficient searches, and some at memory-efficient storage. Understanding data structures is crucial for writing efficient algorithms and building scalable software systems.",
    "category": "Programming Fundamentals",
    "subcategory": "Data Management",
    "domain": "Computer Science",
    "difficulty_level": "intermediate",
    "complexity_score": 6.8,
    "cognitive_load": 7.5,
    "key_terms": [
      "array",
      "linked list",
      "stack",
      "queue",
      "tree",
      "graph",
      "hash table",
      "heap",
      "binary search",
      "traversal",
      "complexity"
    ],
    "synonyms": [
      "Data Organization",
      "Information Structures",
      "Data Models"
    ],
    "learning_objectives": [
      "Compare and contrast different data structures and their use cases",
      "Implement fundamental data structures from scratch",
      "Analyze time and space complexity of data structure operations",
      "Choose appropriate data structures for specific programming problems",
      "Understand how data structures impact algorithm efficiency"
    ],
    "practical_applications": [
      "Database indexing and storage systems",
      "Memory management in operating systems",
      "Network routing and shortest path algorithms",
      "Compilers and interpreters for programming languages",
      "Graphics rendering and game development"
    ],
    "real_world_examples": [
      "Browser history navigation using a stack data structure",
      "Print job management in operating systems using queues",
      "File system directories organized as tree structures",
      "Social media friend networks using graph data structures",
      "Database indexes using B-trees for fast lookups"
    ],
    "common_misconceptions": [
      "Arrays are always faster than linked lists - it depends on the operation needed",
      "Complex data structures are always better - simplicity and clarity matter",
      "All data structures have the same time complexity - different operations have different costs",
      "Data structures are only for computer science - they're used in everyday problem solving",
      "You need to implement everything from scratch - using built-in libraries is often better"
    ]
  },
  "web_development": {
    "name": "web_development",
    "display_name": "Web Development",
    "description": "The process of creating websites and web applications using various technologies and frameworks.",
    "detailed_description": "Web development encompasses the entire process of building websites and web applications, from the frontend user interface to the backend server infrastructure. It involves multiple technologies including HTML for structure, CSS for styling, JavaScript for interactivity, and various backend languages and frameworks. Modern web development also includes responsive design, accessibility, performance optimization, and security considerations.",
    "category": "Software Development",
    "subcategory": "Web Technologies",
    "domain": "Computer Science",
    "difficulty_level": "beginner",
    "complexity_score": 5.5,
    "cognitive_load": 6.0,
    "key_terms": [
      "HTML",
      "CSS",
      "JavaScript",
      "frontend",
      "backend",
      "responsive design",
      "API",
      "framework",
      "database",
      "server",
      "client"
    ],
    "synonyms": [
      "Website Development",
      "Web Application Development",
      "Frontend/Backend Development"
    ],
    "learning_objectives": [
      "Build responsive websites using HTML, CSS, and JavaScript",
      "Understand the client-server architecture of web applications",
      "Create interactive user interfaces and user experiences",
      "Integrate with APIs and databases to build dynamic applications",
      "Deploy web applications to production environments"
    ],
    "practical_applications": [
      "E-commerce websites with shopping carts and payment processing",
      "Social media platforms and content management systems",
      "Online learning platforms and educational tools",
      "Business websites and corporate portals",
      "Web-based productivity tools and applications"
    ],
    "real_world_examples": [
      "Amazon's online marketplace with millions of products",
      "Facebook's social networking platform connecting billions of users",
      "Google's search engine processing billions of queries daily",
      "Netflix's streaming platform with personalized recommendations",
      "Airbnb's accommodation booking platform with real-time availability"
    ],
    "common_misconceptions": [
      "Web development is only about making things look pretty - functionality and user experience matter more",
      "You need to know everything before starting - start with basics and learn as you build",
      "Web development is dying - it's constantly evolving with new technologies and opportunities",
      "Backend and frontend are completely separate - they need to work together seamlessly",
      "Mobile apps are replacing websites - web development skills are still in high demand"
    ]
  }
}