{
  "name": "object_oriented_programming",
  "display_name": "Object-Oriented Programming",
  "description": "A programming paradigm based on the concept of 'objects' which can contain data and code to manipulate that data.",
  "detailed_description": "Object-Oriented Programming (OOP) is a fundamental programming paradigm that organizes code around objects - entities that combine data (attributes) and behavior (methods). This approach promotes code reusability, maintainability, and scalability through concepts like encapsulation, inheritance, and polymorphism. OOP allows developers to model real-world entities and relationships more naturally, making complex systems easier to design, implement, and debug.",
  "category": "Programming Fundamentals",
  "subcategory": "Programming Paradigms",
  "domain": "Computer Science",
  "difficulty_level": "intermediate",
  "complexity_score": 7.5,
  "cognitive_load": 8.2,
  "key_terms": [
    "class",
    "object",
    "instance",
    "method",
    "property",
    "inheritance",
    "polymorphism",
    "encapsulation",
    "abstraction",
    "constructor",
    "destructor"
  ],
  "synonyms": [
    "OOP",
    "Object-Based Programming",
    "Class-Based Programming"
  ],
  "learning_objectives": [
    "Understand the four fundamental principles of OOP: encapsulation, inheritance, polymorphism, and abstraction",
    "Create and use classes to define objects with properties and methods",
    "Implement inheritance to create specialized classes from base classes",
    "Apply polymorphism to write flexible and reusable code",
    "Design software systems using object-oriented principles for better code organization"
  ],
  "practical_applications": [
    "Building user interfaces with GUI frameworks like Tkinter, PyQt, or web frameworks",
    "Creating game engines and interactive applications",
    "Developing enterprise software systems with complex business logic",
    "Building API backends and microservices architecture",
    "Creating data models and database interaction layers"
  ],
  "real_world_examples": [
    "Banking system where Account, SavingsAccount, and CheckingAccount are related classes",
    "E-commerce platform with Product, Electronics, and Clothing as specialized product types",
    "Social media platform with User, Post, Comment, and Media classes and their relationships",
    "Inventory management system with Warehouse, Item, and Supplier classes",
    "Online learning platform with Course, Student, Instructor, and Assignment classes"
  ],
  "common_misconceptions": [
    "OOP is only about creating classes - it's fundamentally about modeling relationships and behaviors",
    "Inheritance should be used for all code reuse - composition is often better than inheritance",
    "More classes always mean better code - simplicity and clarity should guide design decisions",
    "OOP eliminates the need for functions - procedural code within classes is often necessary",
    "All problems should be solved with OOP - different paradigms have different strengths"
  ]
}